# Homepage for Kieran Oakes.
### knowledge base:
[Wiping devices](./wiping-devices.md)

## Brocade 7250 Switch wiping

Notes for resetting Brocade ICX7250:

1)	Connect from your laptop to the Switch (Using the port marked |o|o|) using a console cable (Mini USB-B to com port or USB) and open the application putty.exe.

2)	When putty is open and the device is connected, select "serial" and choose the COM port being used to connect then click Open. If you are unsure on the COM port, please check device manager under "Ports (COM & LPT)"

3)	Once connected using putty, power on the device and press b when prompted, until you are presented with the input "[DEVICE_MODEL]-Boot>":
```
Brocade Bootloader: 10.1.06T215 (Dec 14 2015 - 13:10:57)

Validate Shmoo parameters stored in flash ..... OK
Restoring Shmoo parameters from flash .....
Running simple memory test ..... OK

ICX7250-24 Copper (Non-POE), PVT1
SYS CPLD VER: 0x6, Released Ver: 0

Enter 'b' to stop at boot monitor:  0
ICX7250-Boot>
ICX7250-Boot>
```
4)	Use the following commands, set the switch to bypass password on the next boot:
```
ICX7250-Boot> no password
00 00 00 00
OK! Skip password check when the system is up.
ICX7250-Boot>
ICX7250-Boot> boot
BOOTING image from Primary
```

5)	At this point, the switch will reload and commence the boot process. Wait until you receive the prompt “[HOSTNAME]>”, you may need to press enter several time to get this to show.
a.	If the devices hostname starts with “[MEMBER]” you will need to enter the following commands to remove any previous stack settings and configuration:
```
[MEMBER]local-4@ICX7250-48P Switch>
[MEMBER]local-4@ICX7250-48P Switch>
[MEMBER]local-4@ICX7250-48P Switch>
[MEMBER]local-4@ICX7250-48P Switch> en
No password has been assigned yet...
[MEMBER]local-4@ICX7250-48P Switch#stack unconfigure clean
This unit will delete all config files and boot up as a clean unit. Are you sure? (enter 'y' or 'n'): y
Remove startup config and stacking files. Will reload as a clean unit
Failed - $$sshhost.key could not be removed
Failed - $$sshpub.key could not be removed
[MEMBER]local-4@ICX7250-48P Switch#UNIT4:Debug: Jun  2 15:52:10 Halt and reboot from Primary: reason=unconfigure clean
Copying Hmon Log files to flash..
Done
Copying SZ log files to flash..
Done
CPU Sampling disabled.
Stopping health monitor daemon...
Stopped health monitor daemon
Stopping system statistics daemon...
Stopped systatsd.
Saving the configuration and license files...
[  207.130011] [BrcdSoftlockup]: sim_softwatchdog thread is detached on core=0
Skip the TPM certificates backup (no changes).
The license and configuration backup finished.
The system is going down NOW!
```
This will reload itself after the configuration is removed as seen above.

b.	If the switch just shows the hostname and “MEMBER” is NOT mentioned, please enter the following commands and start the reload manually:
```
lon15-isp01>
lon15-isp01>
lon15-isp01>
lon15-isp01>en
No password has been assigned yet...
lon15-isp01#erase startup-config
Erase startup-config Done.
dhcp server lease database is also removed
stacking flash file is also removed
lon15-isp01#reload
Warning: Console login authentication is enabled, Please make sure users are configured
Are you sure? (enter 'y' or 'n'): y
Could not verify if the Running Config data has been changed.
Sent SIGTERM to all processeseload anyway? (enter 'y' or 'n'): y
Sent SIGKILL to all processes
Requesting system reboot
Restarting system.
```

6)	Allow the switch to reboot until you are either prompted with either of the following:
a.	A login prompt, which you can verify has been wiped using the default credentials:
```
User Access Verification

Please Enter Login Name: super
Please Enter Password: sp-admin
User login successful.


User super login successful with default password. Please change the password.

Enter the new password for user super :
```

Do NOT set up a password, at this point you can power off the switch

b.	A switch prompt with the model name, which can be verified  as wiped using the following command:
```
ICX7250-24 Switch>
ICX7250-24 Switch>
ICX7250-24 Switch>en
No password has been assigned yet...
ICX7250-24 Switch#
ICX7250-24 Switch#erase startup-config
There is no startup config file, unable to save legacy config
```

The line “There is no startup config” indicates that the process was successful


Any questions, please contact me (Kieran Oakes) for further information.

